ddxd001/gugaPI/gugaPI/empty_cpp.syscfg
GPIO7.$name                          = "GPIO_LED_B";
GPIO7.port                           = "PORTB";
GPIO7.portSegment                    = "Upper";
GPIO7.associatedPins[0].$name        = "LED3";
GPIO7.associatedPins[0].initialValue = "SET";
GPIO7.associatedPins[0].assignedPin  = "27";

GPIO8.$name                              = "GPIO_GY931_I2C";
GPIO8.port                               = "PORTA";
GPIO8.portSegment                        = "Upper";
GPIO8.associatedPins.create(2);
GPIO8.associatedPins[0].$name            = "GY931_SCL";
GPIO8.associatedPins[0].direction        = "INPUT";
GPIO8.associatedPins[0].internalResistor = "PULL_UP";
GPIO8.associatedPins[0].assignedPin      = "29";
GPIO8.associatedPins[1].$name            = "GY931_SDA";
GPIO8.associatedPins[1].direction        = "INPUT";
GPIO8.associatedPins[1].internalResistor = "PULL_UP";
GPIO8.associatedPins[1].assignedPin      = "30";

GPIO9.$name                         = "GPIO_GRAY_C";
GPIO9.port                          = "PORTC";
GPIO9.portSegment                   = "Upper";
GPIO9.associatedPins.create(2);
GPIO9.associatedPins[0].$name       = "GRAY_SEL0";
GPIO9.associatedPins[0].assignedPin = "21";
GPIO9.associatedPins[1].$name       = "GRAY_SEL1";
GPIO9.associatedPins[1].assignedPin = "20";

GPIO10.$name                         = "GPIO_GRAY_A";
GPIO10.port                          = "PORTA";
GPIO10.portSegment                   = "Upper";
GPIO10.associatedPins[0].$name       = "GRAY_SEL2";
GPIO10.associatedPins[0].assignedPin = "16";

/* TCAN3413 STB: low=Normal, high=Standby. */
GPIO11.$name                                      = "GPIO_CAN_CTRL";
GPIO11.port                                       = "PORTC";
GPIO11.portSegment                                = "Upper";
GPIO11.associatedPins[0].$name                    = "CAN_STB";
GPIO11.associatedPins[0].initialValue             = "CLEARED";
GPIO11.associatedPins[0].assignedPin              = "25";

/* Keep both DRV8876 bridges asleep until board initialization completes. */
GPIO12.$name                                  = "GPIO_MOTOR_SLEEP";
GPIO12.port                                   = "PORTA";
GPIO12.portSegment                            = "Lower";
GPIO12.associatedPins.create(2);
GPIO12.associatedPins[0].$name                = "MOTOR_RIGHT_NSLEEP";
GPIO12.associatedPins[0].initialValue         = "CLEARED";
GPIO12.associatedPins[0].assignedPin          = "10";
GPIO12.associatedPins[0].pin.$assign          = "PA10";
GPIO12.associatedPins[1].$name                = "MOTOR_LEFT_NSLEEP";
GPIO12.associatedPins[1].initialValue         = "CLEARED";
GPIO12.associatedPins[1].assignedPin          = "11";
GPIO12.associatedPins[1].pin.$assign          = "PA11";

GPIO13.$name                                  = "GPIO_MOTOR_DIRECTION";
GPIO13.port                                   = "PORTB";
GPIO13.portSegment                            = "Any";
GPIO13.associatedPins.create(4);
GPIO13.associatedPins[0].$name                = "MOTOR_RIGHT_PH";
GPIO13.associatedPins[0].initialValue         = "CLEARED";
GPIO13.associatedPins[0].assignedPin          = "7";
GPIO13.associatedPins[0].pin.$assign          = "PB7";
GPIO13.associatedPins[1].$name                = "MOTOR_LEFT_PH";
GPIO13.associatedPins[1].initialValue         = "CLEARED";
GPIO13.associatedPins[1].assignedPin          = "9";
GPIO13.associatedPins[1].pin.$assign          = "PB9";
/* The unused left encoder remains input-only; never drive its outputs. */
GPIO13.associatedPins[2].$name                = "MOTOR_LEFT_ENCODER_A";
GPIO13.associatedPins[2].direction            = "INPUT";
GPIO13.associatedPins[2].assignedPin          = "15";
GPIO13.associatedPins[2].pin.$assign          = "PB15";
GPIO13.associatedPins[3].$name                = "MOTOR_LEFT_ENCODER_B";
GPIO13.associatedPins[3].direction            = "INPUT";
GPIO13.associatedPins[3].assignedPin          = "16";
GPIO13.associatedPins[3].pin.$assign          = "PB16";

I2C1.basicEnableController             = true;
I2C1.basicControllerBusSpeed           = 400000;
I2C1.$name                             = "SENSOR_I2C";
I2C1.advAnalogGlitchFilter             = "DISABLED";
I2C1.peripheral.$assign                = "I2C2";
I2C1.peripheral.sdaPin.$assign         = "PC3";
I2C1.peripheral.sclPin.$assign         = "PC2";
I2C1.sdaPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C1.sdaPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C1.sdaPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C1.sdaPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";
I2C1.sclPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C1.sclPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C1.sclPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C1.sclPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric7";

PWM1.$name                              = "MOTOR_PWM";
PWM1.ccIndex                            = [0];
PWM1.clockDivider                       = 2;
PWM1.timerCount                         = 2000;
PWM1.timerStartTimer                    = false;
PWM1.peripheral.$assign                 = "TIMG12";
PWM1.peripheral.ccp0Pin.$assign         = "PB13";
PWM1.ccp0PinConfig.$name                = "GPIO_MOTOR_RIGHT_PWM";
PWM1.PWM_CHANNEL_0.$name                = "MOTOR_RIGHT_PWM_CHANNEL";
PWM1.PWM_CHANNEL_0.initVal              = "LOW";
PWM1.PWM_CHANNEL_0.dutyCycle            = 0;

QEI1.$name                              = "RIGHT_MOTOR_QEI";
QEI1.loadValue                          = 0xFFFF;
QEI1.timerStartTimer                    = false;
QEI1.peripheral.$assign                 = "TIMG8";
QEI1.peripheral.ccp0Pin.$assign         = "PC0";
QEI1.peripheral.ccp1Pin.$assign         = "PC1";
QEI1.ccp0PinConfig.$name                = "GPIO_RIGHT_MOTOR_QEI_PHA";
QEI1.ccp0PinConfig.enableConfig         = true;
QEI1.ccp0PinConfig.internalResistor      = "PULL_UP";
QEI1.ccp1PinConfig.$name                = "GPIO_RIGHT_MOTOR_QEI_PHB";
QEI1.ccp1PinConfig.enableConfig         = true;
QEI1.ccp1PinConfig.internalResistor      = "PULL_UP";

SPI1.$name                              = "IMU_SPI";
SPI1.targetBitRate                      = 1000000;
SPI1.frameFormat                        = "MOTO3";
SPI1.polarity                           = "1";
SPI1.phase                              = "1";
SPI1.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
SPI1.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI1.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";
SPI1.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric12";
SPI1.peripheral.sclkPin.$assign         = "PB18";
SPI1.peripheral.mosiPin.$assign         = "PB17";
SPI1.peripheral.misoPin.$assign         = "PB19";

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn           = true;
SYSCTL.validateClkStatus     = true;
SYSCTL.SYSPLL_CLK1En         = true;

